__mod_name__ = "Fᴜɴ"

__help__ = """
*Tʀᴜᴛʜ & Dᴀʀᴇ*
 ❍ /truth *:* Sᴇɴᴅs ᴀ ʀᴀɴᴅᴏᴍ ᴛʀᴜᴛʜ sᴛʀɪɴɢ
 ❍ /dare *:* Sᴇɴᴅs ᴀ ʀᴀɴᴅᴏᴍ ᴅᴀʀᴇ sᴛʀɪɴɢ
 ❍/sh *:* 
 
 *NSFW:*
  ❍ /addnsfw : Eɴᴀʙʟᴇ NSFW ᴍᴏᴅᴇ
  ❍ /rmnsfw  : Dɪsᴀʙʟᴇ NSFW ᴍᴏᴅᴇ
 
 *Aᴠᴀɪʟᴀʙʟᴇ ᴄᴏᴍᴍᴀɴᴅs:*  
 
 - /neko : Sᴇɴᴅs Rᴀɴᴅᴏᴍ SFW Nᴇᴋᴏ sᴏᴜʀᴄᴇ Iᴍᴀɢᴇs.
 - /feet : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Aɴɪᴍᴇ Fᴇᴇᴛ Iᴍᴀɢᴇs.
 - /yuri : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Yᴜʀɪ sᴏᴜʀᴄᴇ Iᴍᴀɢᴇs.
 - /trap : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Tʀᴀᴘ sᴏᴜʀᴄᴇ Iᴍᴀɢᴇs.
 - /futanari : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Fᴜᴛᴀɴᴀʀɪ sᴏᴜʀᴄᴇ Iᴍᴀɢᴇs.
 - /hololewds : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Hᴏʟᴏ Lᴇᴡᴅs.
 - /lewdkemo : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Kᴇᴍᴏ Lᴇᴡᴅs.
 - /sologif : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Sᴏʟᴏ GIFs.
 - /cumgif : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Cᴜᴍ GIFs.
 - /erokemo : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Eʀᴏ-Kᴇᴍᴏ Iᴍᴀɢᴇs.
 - /lesbian : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Lᴇs Sᴏᴜʀᴄᴇ Iᴍᴀɢᴇs.
 - /lewdk : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Kɪᴛsᴜɴᴇ Lᴇᴡᴅs.
 - /ngif : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Nᴇᴋᴏ GIFs.
 - /tickle : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Tɪᴄᴋʟᴇ GIFs.
 - /lewd : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Lᴇᴡᴅs.
 - /feed : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Fᴇᴇᴅɪɴɢ GIFs.
 - /eroyuri : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Eʀᴏ-Yᴜʀɪ sᴏᴜʀᴄᴇ Iᴍᴀɢᴇs.
 - /eron : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Eʀᴏ-Nᴇᴋᴏ sᴏᴜʀᴄᴇ Iᴍᴀɢᴇs.
 - /cum : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Cᴜᴍ Iᴍᴀɢᴇs.
 - /bjgif : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Bʟᴏᴡ Jᴏʙ GIFs.
 - /bj : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Bʟᴏᴡ Jᴏʙ sᴏᴜʀᴄᴇ Iᴍᴀɢᴇs.
 - /nekonsfw : Sᴇɴᴅs Rᴀɴᴅᴏᴍ NSFW Nᴇᴋᴏ sᴏᴜʀᴄᴇ Iᴍᴀɢᴇs.
 - /solo : Sᴇɴᴅs Rᴀɴᴅᴏᴍ NSFW Nᴇᴋᴏ GIFs.
 - /kemonomimi : Sᴇɴᴅs Rᴀɴᴅᴏᴍ KᴇᴍᴏɴᴏMɪᴍɪ sᴏᴜʀᴄᴇ Iᴍᴀɢᴇs.
 - /avatarlewd : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Aᴠᴀᴛᴇʀ Lᴇᴡᴅ Sᴛɪᴄᴋᴇʀs.
 - /gasm : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Oʀɢᴀsᴍ Sᴛɪᴄᴋᴇʀs.
 - /poke : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Pᴏᴋᴇ GIFs.
 - /anal : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Aɴᴀʟ GIFs.
 - /hental :  Sᴇɴᴅs Rᴀɴᴅᴏᴍ Hᴇɴᴛᴀɪ sᴏᴜʀᴄᴇ Iᴍᴀɢᴇs.
 - /avatar : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Aᴠᴀᴛᴀʀ Sᴛɪᴄᴋᴇʀs.
 - /erofeet : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Eʀᴏ-Fᴇᴇᴛ sᴏᴜʀᴄᴇ Iᴍᴀɢᴇs.
 - /holo : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Hᴏʟᴏ sᴏᴜʀᴄᴇ Iᴍᴀɢᴇs.
 - /tits : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Tɪᴛs sᴏᴜʀᴄᴇ Iᴍᴀɢᴇs.
 - /pussygif : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Pᴜssʏ GIFs.
 - /holoero : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Eʀᴏ-Hᴏʟᴏ sᴏᴜʀᴄᴇ Iᴍᴀɢᴇs.
 - /pussy : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Pᴜssʏ sᴏᴜʀᴄᴇ Iᴍᴀɢᴇs.
 - /hentaigif : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Hᴇɴᴛᴀɪ GIFs.
 - /classic : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Cʟᴀssɪᴄ Hᴇɴᴛᴀɪ GIFs.
 - /kuni : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Pᴜssʏ Lɪᴄᴋ GIFs.
 - /waifu : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Wᴀɪғᴜ Sᴛɪᴄᴋᴇʀs.
 - /kiss  Sᴇɴᴅs Rᴀɴᴅᴏᴍ Kɪssɪɴɢ GIFs.
 - /femdim : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Fᴇᴍᴅᴏᴍ sᴏᴜʀᴄᴇ Iᴍᴀɢᴇs.
 - /coddle : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Cᴜᴅᴅʟᴇ GIFs.
 - /erok : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Eʀᴏ-Kɪᴛsᴜɴᴇ sᴏᴜʀᴄᴇ Iᴍᴀɢᴇs.
 - /foxgirl : Sᴇɴᴅs Rᴀɴᴅᴏᴍ FᴏxGɪʀʟ sᴏᴜʀᴄᴇ Iᴍᴀɢᴇs.
 - /titsgif : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Tɪᴛs GIFs.
 - /ᴇro : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Eʀᴏ sᴏᴜʀᴄᴇ Iᴍᴀɢᴇs.
 - /smug : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Sᴍᴜɢ GIFs.
 - /baka : Sᴇɴᴅs Rᴀɴᴅᴏᴍ Bᴀᴋᴀ Sʜᴏᴜᴛ GIFs.
 - /dva : Sᴇɴᴅs Rᴀɴᴅᴏᴍ D.VA sᴏᴜʀᴄᴇ Iᴍᴀɢᴇs.
 ❍ /runs*:* ʀᴇᴘʟʏ ᴀ ʀᴀɴᴅᴏᴍ sᴛʀɪɴɢ ғʀᴏᴍ ᴀɴ ᴀʀʀᴀʏ ᴏғ ʀᴇᴘʟɪᴇs
 ❍ /slap*:* sʟᴀᴘ ᴀ ᴜsᴇʀ, ᴏʀ ɢᴇᴛ sʟᴀᴘᴘᴇᴅ ɪғ ɴᴏᴛ ᴀ ʀᴇᴘʟʏ
 ❍ /shrug*:* ɢᴇᴛ sʜʀᴜɢ XD
 ❍ /table*:* ɢᴇᴛ ғʟɪᴘ/ᴜɴғʟɪᴘ :v
 ❍ /decide*:* Rᴀɴᴅᴏᴍʟʏ ᴀɴsᴡᴇʀs ʏᴇs/ɴᴏ/ᴍᴀʏʙᴇ
 ❍ /toss*:* Tᴏssᴇᴅ ᴀ ᴄᴏɪɴ 
 ❍ /bluetext*:* ᴄʜᴇᴄᴋ ᴜʀsᴇʟғ :V
 ❍ /roll*:* ʀᴏʟʟ ᴀ ᴅɪᴄᴇ 
 ❍ /rlg*:* Jᴏɪɴ ᴇᴀʀs,ɴᴏsᴇ,ᴍᴏᴜᴛʜ ᴀɴᴅ ᴄʀᴇᴀᴛᴇ ᴀɴ ᴇᴍᴏ ;-;
 ❍ /shout <keyword>*:* ᴡʀɪᴛᴇ ᴀɴʏᴛʜɪɴɢ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ɢɪᴠᴇ ʟᴏᴜᴅ sʜᴏᴜᴛ
 ❍ /weebify <text>*:* ʀᴇᴛᴜʀɴs ᴀ ᴡᴇᴇʙɪғɪᴇᴅ ᴛᴇxᴛ
 ❍ /sanitize*:* ᴀʟᴡᴀʏs ᴜsᴇ ᴛʜɪs ʙᴇғᴏʀᴇ /pat  ᴏʀ ᴀɴʏ ᴄᴏɴᴛᴀᴄᴛ
 ❍ /pat*:* ᴘᴀᴛs ᴀ ᴜsᴇʀ, ᴏʀ ɢᴇᴛ ᴘᴀᴛᴛᴇᴅ
 ❍ /8ball*:* ᴘʀᴇᴅɪᴄᴛs ᴜsɪɴɢ 8ʙᴀʟʟ ᴍᴇᴛʜᴏᴅ 
 
   𒊹︎︎︎ ᴘᴏᴡᴇʀᴅ ʙʏ @Abishnoi1M
"""
